Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes
The MarkBaseAttributes class is the attributes class for the mark base.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.Angle
The actual angle of the mark, in degrees. Can differ from the rotation angle
set by the user for marks, e.g. 45-degree column marks in GA drawings or
when placing mark along part edges.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.RotationAngle
The mark rotation angle set by the user. Unit is degrees.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.TransparentBackground
The mark text background transparency. (transparent/opaque)

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.TextAlignment
The mark text alignment.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.Frame
The frame attributes of the mark's labels.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.ArrowHead
The arrowhead of the leader line(s).

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.PreferredPlacing
The type of placing the object should use.
See the preferred placing types for different types of placing.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.PlacingAttributes
The placing attributes that the object should use.
Using these you can specify whether the object is automatically arranged in the drawing or not.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.CustomPresentation
Custom presentation GUID to be applied to the object type

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.#ctor
Creates a new default mark base attributes instance that loads standard attributes.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.#ctor(System.String)
Creates a new mark base attributes instance with the given attributes file's filename.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes.#ctor(System.Boolean)
Creates a new mark base attributes instance without loading attributes from file.
DoNotLoadAttributes: If it set to true attributes won't be lodaded.